/*
 * PWM_ATTINY13.c
 *
 * Created: 09.12.2021 12:54:43
 * Author : CanchezAK
 */ 
#define F_CPU 4800000UL
#define LED0 PB0

#include <avr/io.h>
#include <util/delay.h>
#include <avr/pgmspace.h>

uint8_t pwr_on = 0;

void pulse();
void delay_us(long us);

void delay_us(long us)
{
	us = us/48;
	do 
	{
		us--;
	}
	while(us != 0);
}

const uint8_t  PWM_table[256] PROGMEM= {
	0 , 0 , 0 , 0 , 0 , 0 , 0 , 0 , 0 , 0 , 0 , 0 , 0 , 0 , 0 , 0,
	0 , 0 , 0 , 0 , 0 , 0 , 0 , 0 , 0 , 1 , 1 , 1 , 1 , 1 , 1 , 1,
	1 , 2 , 2 , 2 , 2 , 2 , 2 , 2 , 3 , 3 , 3 , 3 , 3 , 4 , 4 , 4,
	4 , 5 , 5 , 5 , 5 , 6 , 6 , 6 , 6 , 7 , 7 , 7 , 8 , 8 , 8 , 9,
	9 , 9 , 10 , 10 , 10 , 11 , 11 , 12 , 12 , 12 , 13 , 13 , 14 , 14 , 15 , 15,
	16 , 16 , 17 , 17 , 18 , 18 , 19 , 19 , 20 , 20 , 21 , 21 , 22 , 23 , 23 , 24,
	24 , 25 , 26 , 26 , 27 , 28 , 28 , 29 , 30 , 30 , 31 , 32 , 32 , 33 , 34 , 35,
	35 , 36 , 37 , 38 , 38 , 39 , 40 , 41 , 42 , 43 , 43 , 44 , 45 , 46 , 47 , 48,
	49 , 50 , 51 , 52 , 52 , 53 , 54 , 55 , 56 , 57 , 58 , 59 , 60 , 61 , 63 , 64,
	65 , 66 , 67 , 68 , 69 , 70 , 71 , 72 , 74 , 75 , 76 , 77 , 78 , 80 , 81 , 82,
	83 , 85 , 86 , 87 , 88 , 90 , 91 , 92 , 94 , 95 , 96 , 98 , 99 , 100 , 102 , 103,
	105 , 106 , 108 , 109 , 110 , 112 , 113 , 115 , 116 , 118 , 120 , 121 , 123 , 124 , 126 , 127,
	129 , 131 , 132 , 134 , 135 , 137 , 139 , 141 , 142 , 144 , 146 , 147 , 149 , 151 , 153 , 154,
	156 , 158 , 160 , 162 , 164 , 165 , 167 , 169 , 171 , 173 , 175 , 177 , 179 , 181 , 183 , 185,
	187 , 189 , 191 , 193 , 195 , 197 , 199 , 201 , 203 , 205 , 207 , 209 , 211 , 214 , 216 , 218,
	220 , 222 , 225 , 227 , 229 , 231 , 234 , 236 , 238 , 240 , 243 , 245 , 247 , 250 , 252 , 255
};

void bpm_pulse(uint32_t pul)
{
	uint8_t bpm = 60000000/pul;
	
	delay_us(bpm/2);
	pulse();
	delay_us(bpm/2);
	pulse();
}

void pulse()
{
	uint8_t count = 0;
	do
	{
		OCR0A = PWM_table[count];
		count++;
		_delay_us(400);
	}
	while(count!=255);
		
	do
	{
		OCR0A = PWM_table[count];
		count--;
		_delay_us(400);
	}
	while (count!=0);
}


int main(void)
{
	asm("cli");
    DDRB |= (1 << LED0);
	PORTB = 0x04;
    TCCR0A = 0x83; // режим ШИМ, неинверсный сигнал на выходе OC0A
    TCCR0B = 0x02;
    TCNT0=0;
    OCR0A=0;
	asm("sei");
	
    while (1) 
    {
		if ((PINB & (1<<2)) == 0)
		{
			bpm_pulse(50);
		}
    }
}

